MikroElektronika/core_packages/ARM/gcc_clang/def/pic32/PIC32CX1012BZ25048/mcu.h
/* ************************************************************************** */
/* Event Generator IDs for C32CX1012BZ25048 */
/* ************************************************************************** */
#define EVENT_ID_GEN_RTC_PER_0                            1 /* ID for RTC event generator PER_0 */
#define EVENT_ID_GEN_RTC_PER_1                            2 /* ID for RTC event generator PER_1 */
#define EVENT_ID_GEN_RTC_PER_2                            3 /* ID for RTC event generator PER_2 */
#define EVENT_ID_GEN_RTC_PER_3                            4 /* ID for RTC event generator PER_3 */
#define EVENT_ID_GEN_RTC_PER_4                            5 /* ID for RTC event generator PER_4 */
#define EVENT_ID_GEN_RTC_PER_5                            6 /* ID for RTC event generator PER_5 */
#define EVENT_ID_GEN_RTC_PER_6                            7 /* ID for RTC event generator PER_6 */
#define EVENT_ID_GEN_RTC_PER_7                            8 /* ID for RTC event generator PER_7 */
#define EVENT_ID_GEN_RTC_CMP_0                            9 /* ID for RTC event generator CMP_0 */
#define EVENT_ID_GEN_RTC_CMP_1                           10 /* ID for RTC event generator CMP_1 */
#define EVENT_ID_GEN_RTC_CMP_2                           11 /* ID for RTC event generator CMP_2 */
#define EVENT_ID_GEN_RTC_CMP_3                           12 /* ID for RTC event generator CMP_3 */
#define EVENT_ID_GEN_RTC_TAMPER                          13 /* ID for RTC event generator TAMPER */
#define EVENT_ID_GEN_RTC_OVF                             14 /* ID for RTC event generator OVF */
#define EVENT_ID_GEN_EIC_EXTINT_0                        15 /* ID for EIC event generator EXTINT_0 */
#define EVENT_ID_GEN_EIC_EXTINT_1                        16 /* ID for EIC event generator EXTINT_1 */
#define EVENT_ID_GEN_EIC_EXTINT_2                        17 /* ID for EIC event generator EXTINT_2 */
#define EVENT_ID_GEN_EIC_EXTINT_3                        18 /* ID for EIC event generator EXTINT_3 */
#define EVENT_ID_GEN_DMAC_CH_0                           19 /* ID for DMAC event generator CH_0 */
#define EVENT_ID_GEN_DMAC_CH_1                           20 /* ID for DMAC event generator CH_1 */
#define EVENT_ID_GEN_DMAC_CH_2                           21 /* ID for DMAC event generator CH_2 */
#define EVENT_ID_GEN_DMAC_CH_3                           22 /* ID for DMAC event generator CH_3 */
#define EVENT_ID_GEN_PAC_ACCERR                          23 /* ID for PAC event generator ACCERR */
#define EVENT_ID_GEN_TCC0_OVF                            24 /* ID for TCC0 event generator OVF */
#define EVENT_ID_GEN_TCC0_TRG                            25 /* ID for TCC0 event generator TRG */
#define EVENT_ID_GEN_TCC0_CNT                            26 /* ID for TCC0 event generator CNT */
#define EVENT_ID_GEN_TCC0_MC_0                           27 /* ID for TCC0 event generator MC_0 */
#define EVENT_ID_GEN_TCC0_MC_1                           28 /* ID for TCC0 event generator MC_1 */
#define EVENT_ID_GEN_TCC0_MC_2                           29 /* ID for TCC0 event generator MC_2 */
#define EVENT_ID_GEN_TCC0_MC_3                           30 /* ID for TCC0 event generator MC_3 */
#define EVENT_ID_GEN_TCC0_MC_4                           31 /* ID for TCC0 event generator MC_4 */
#define EVENT_ID_GEN_TCC0_MC_5                           32 /* ID for TCC0 event generator MC_5 */
#define EVENT_ID_GEN_TCC1_OVF                            33 /* ID for TCC1 event generator OVF */
#define EVENT_ID_GEN_TCC1_TRG                            34 /* ID for TCC1 event generator TRG */
#define EVENT_ID_GEN_TCC1_CNT                            35 /* ID for TCC1 event generator CNT */
#define EVENT_ID_GEN_TCC1_MCX_0                          36 /* ID for TCC1 event generator MCX_0 */
#define EVENT_ID_GEN_TCC1_MCX_1                          37 /* ID for TCC1 event generator MCX_1 */
#define EVENT_ID_GEN_TCC1_MCX_2                          38 /* ID for TCC1 event generator MCX_2 */
#define EVENT_ID_GEN_TCC1_MCX_3                          39 /* ID for TCC1 event generator MCX_3 */
#define EVENT_ID_GEN_TCC1_MCX_4                          40 /* ID for TCC1 event generator MCX_4 */
#define EVENT_ID_GEN_TCC1_MCX_5                          41 /* ID for TCC1 event generator MCX_5 */
#define EVENT_ID_GEN_TCC2_OVF                            42 /* ID for TCC2 event generator OVF */
#define EVENT_ID_GEN_TCC2_TRG                            43 /* ID for TCC2 event generator TRG */
#define EVENT_ID_GEN_TCC2_CNT                            44 /* ID for TCC2 event generator CNT */
#define EVENT_ID_GEN_TCC2_MCX_0                          45 /* ID for TCC2 event generator MCX_0 */
#define EVENT_ID_GEN_TCC2_MCX_1                          46 /* ID for TCC2 event generator MCX_1 */
#define EVENT_ID_GEN_TC0_OVF                             47 /* ID for TC0 event generator OVF */
#define EVENT_ID_GEN_TC0_MCX_0                           48 /* ID for TC0 event generator MCX_0 */
#define EVENT_ID_GEN_TC0_MCX_1                           49 /* ID for TC0 event generator MCX_1 */
#define EVENT_ID_GEN_TC1_OVF                             50 /* ID for TC1 event generator OVF */
#define EVENT_ID_GEN_TC1_MCX_0                           51 /* ID for TC1 event generator MCX_0 */
#define EVENT_ID_GEN_TC1_MCX_1                           52 /* ID for TC1 event generator MCX_1 */
#define EVENT_ID_GEN_TC2_OVF                             53 /* ID for TC2 event generator OVF */
#define EVENT_ID_GEN_TC2_MCX_0                           54 /* ID for TC2 event generator MCX_0 */
#define EVENT_ID_GEN_TC2_MCX_1                           55 /* ID for TC2 event generator MCX_1 */
#define EVENT_ID_GEN_TC3_OVF                             56 /* ID for TC3 event generator OVF */
#define EVENT_ID_GEN_TC3_MCX_0                           57 /* ID for TC3 event generator MCX_0 */
#define EVENT_ID_GEN_TC3_MCX_1                           58 /* ID for TC3 event generator MCX_1 */
#define EVENT_ID_GEN_ADC_RESRDY                          59 /* ID for ADCHS event generator ADC_RESRDY */
#define EVENT_ID_GEN_AC_COMP_0                           62 /* ID for AC event generator COMP_0 */
#define EVENT_ID_GEN_AC_COMP_1                           63 /* ID for AC event generator COMP_1 */
#define EVENT_ID_GEN_AC_WIN_0                            64 /* ID for AC event generator WIN_0 */
#define EVENT_ID_GEN_TRNG_READY                          65 /* ID for TRNG event generator READY */
#define EVENT_ID_GEN_CCL_LUTOUT_0                        66 /* ID for CCL event generator LUTOUT_0 */
#define EVENT_ID_GEN_CCL_LUTOUT_1                        67 /* ID for CCL event generator LUTOUT_1 */
#define EVENT_ID_GEN_ZB_TX_TS_ACT                        68 /* ID for ZBT event generator ZB_TX_TS_ACT */
#define EVENT_ID_GEN_ZB_RX_TS_ACT                        69 /* ID for ZBT event generator ZB_RX_TS_ACT */

/* ************************************************************************** */
/*  Event User IDs for C32CX1012BZ25048 */
/* ************************************************************************** */
#define EVENT_ID_USER_RTC_TAMPER                          0 /* ID for RTC event user TAMPER */
#define EVENT_ID_USER_DMAC_CH_0                           1 /* ID for DMAC event user CH_0 */
#define EVENT_ID_USER_DMAC_CH_1                           2 /* ID for DMAC event user CH_1 */
#define EVENT_ID_USER_DMAC_CH_2                           3 /* ID for DMAC event user CH_2 */
#define EVENT_ID_USER_DMAC_CH_3                           4 /* ID for DMAC event user CH_3 */
#define EVENT_ID_USER_DMAC_CH_4                           5 /* ID for DMAC event user CH_4 */
#define EVENT_ID_USER_DMAC_CH_5                           6 /* ID for DMAC event user CH_5 */
#define EVENT_ID_USER_DMAC_CH_6                           7 /* ID for DMAC event user CH_6 */
#define EVENT_ID_USER_DMAC_CH_7                           8 /* ID for DMAC event user CH_7 */
#define EVENT_ID_USER_CM4_TRACE_START                     9 /* ID for CM4 event user TRACE_START */
#define EVENT_ID_USER_CM4_TRACE_STOP                     10 /* ID for CM4 event user TRACE_STOP */
#define EVENT_ID_USER_CM4_TRACE_TRIG                     11 /* ID for CM4 event user TRACE_TRIG */
#define EVENT_ID_USER_TCC0_EV_0                          12 /* ID for TCC0 event user EV_0 */
#define EVENT_ID_USER_TCC0_EV_1                          13 /* ID for TCC0 event user EV_1 */
#define EVENT_ID_USER_TCC0_MC_0                          14 /* ID for TCC0 event user MC_0 */
#define EVENT_ID_USER_TCC0_MC_1                          15 /* ID for TCC0 event user MC_1 */
#define EVENT_ID_USER_TCC0_MC_2                          16 /* ID for TCC0 event user MC_2 */
#define EVENT_ID_USER_TCC0_MC_3                          17 /* ID for TCC0 event user MC_3 */
#define EVENT_ID_USER_TCC0_MC_4                          18 /* ID for TCC0 event user MC_4 */
#define EVENT_ID_USER_TCC0_MC_5                          19 /* ID for TCC0 event user MC_5 */
#define EVENT_ID_USER_TCC1_EV_0                          20 /* ID for TCC1 event user EV_0 */
#define EVENT_ID_USER_TCC1_EV_1                          21 /* ID for TCC1 event user EV_1 */
#define EVENT_ID_USER_TCC1_MC_0                          22 /* ID for TCC1 event user MC_0 */
#define EVENT_ID_USER_TCC1_MC_1                          23 /* ID for TCC1 event user MC_1 */
#define EVENT_ID_USER_TCC1_MC_2                          24 /* ID for TCC1 event user MC_2 */
#define EVENT_ID_USER_TCC1_MC_3                          25 /* ID for TCC1 event user MC_3 */
#define EVENT_ID_USER_TCC1_MC_4                          26 /* ID for TCC1 event user MC_4 */
#define EVENT_ID_USER_TCC1_MC_5                          27 /* ID for TCC1 event user MC_5 */
#define EVENT_ID_USER_TCC2_EV_0                          28 /* ID for TCC2 event user EV_0 */
#define EVENT_ID_USER_TCC2_EV_1                          29 /* ID for TCC2 event user EV_1 */
#define EVENT_ID_USER_TCC2_MC_0                          30 /* ID for TCC2 event user MC_0 */
#define EVENT_ID_USER_TCC2_MC_1                          31 /* ID for TCC2 event user MC_1 */
#define EVENT_ID_USER_TC0_EVU                            32 /* ID for TC0 event user EVU */
#define EVENT_ID_USER_TC1_EVU                            33 /* ID for TC1 event user EVU */
#define EVENT_ID_USER_TC2_EVU                            34 /* ID for TC2 event user EVU */
#define EVENT_ID_USER_TC3_EVU                            35 /* ID for TC3 event user EVU */
#define EVENT_ID_USER_ADC_TRIG_5                         36 /* ID for ADCHS event user ADC_TRIG_5 */
#define EVENT_ID_USER_ADC_TRIG_6                         37 /* ID for ADCHS event user ADC_TRIG_6 */
#define EVENT_ID_USER_ADC_TRIG_7                         38 /* ID for ADCHS event user ADC_TRIG_7 */
#define EVENT_ID_USER_ADC_TRIG_8                         39 /* ID for ADCHS event user ADC_TRIG_8 */
#define EVENT_ID_USER_ADC_TRIG_9                         40 /* ID for ADCHS event user ADC_TRIG_9 */
#define EVENT_ID_USER_ADC_TRIG_10                        41 /* ID for ADCHS event user ADC_TRIG_10 */
#define EVENT_ID_USER_ADC_TRIG_11                        42 /* ID for ADCHS event user ADC_TRIG_11 */
#define EVENT_ID_USER_ADC_TRIG_12                        43 /* ID for ADCHS event user ADC_TRIG_12 */
#define EVENT_ID_USER_ADC_TRIG_13                        44 /* ID for ADCHS event user ADC_TRIG_13 */
#define EVENT_ID_USER_ADC_TRIG_14                        45 /* ID for ADCHS event user ADC_TRIG_14 */
#define EVENT_ID_USER_ADC_TRIG_15                        46 /* ID for ADCHS event user ADC_TRIG_15 */
#define EVENT_ID_USER_ADC_TRIG_16                        47 /* ID for ADCHS event user ADC_TRIG_16 */
#define EVENT_ID_USER_AC_SOC_0                           48 /* ID for AC event user SOC_0 */
#define EVENT_ID_USER_AC_SOC_1                           49 /* ID for AC event user SOC_1 */
#define EVENT_ID_USER_CCL_LUTIN_0                        50 /* ID for CCL event user LUTIN_0 */
#define EVENT_ID_USER_CCL_LUTIN_1                        51 /* ID for CCL event user LUTIN_1 */

#ifdef __cplusplus
}
#endif

#endif /* _PIC32CX1012BZ25048_H_ */

